Catalogs/ИА_НастройкиРабочегоСтолаСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_НастройкиРабочегоСтолаСтатистик</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнойПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВСтроке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалить_ОтображатьТолькоЗавершенныеПериоды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерШрифта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПериодДетализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтатистики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДетализации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокДиаграммы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветГрафика</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ЦветаГрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДляЛегенды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьВИЦО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИА_ПериодКвоты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИА_НеОтображатьНаРабочемСтоле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИА_ТипКвоты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипыКвот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветГрафикаНарастающейКвоты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ЦветаГрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветГрафикаХран</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветГрафикаНарастающейКвотыХран</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УзорТочки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_УзорыТочекСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаштабМинимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаштабМаксимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СдвигПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСдвигаПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ИА_ТипыКвот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ТипыКвот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нарастающая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ПериодыДетализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПериодыДетализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_НастройкиРабочегоСтолаСтатистик/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтатистикиВидСтатистикиПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Статистики.ТекущиеДанные;
	ДанныеСтроки.Аналитика1 = Неопределено;
	ДанныеСтроки.Аналитика2 = Неопределено;
	ДанныеСтроки.Аналитика3 = Неопределено;
	
	структДанных = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3,ЕстьАналитика1,ЕстьАналитика2,ЕстьАналитика3");
	ЗаполнитьЗначенияСвойств(структДанных,ДанныеСтроки);
	СтатистикиВидСтатистикиПриИзменении_Сервер(структДанных);
	ЗаполнитьЗначенияСвойств(ДанныеСтроки,структДанных);
	
	ЗаполнитьНаименованиеДляЛегенды(ДанныеСтроки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СтатистикиВидСтатистикиПриИзменении_Сервер(структДанных)
	структДанных.ЕстьАналитика1 = Ложь;
	структДанных.ЕстьАналитика2 = Ложь;
	структДанных.ЕстьАналитика3 = Ложь;
	
	Если не структДанных.ВидСтатистики.Пустая() Тогда
 		Если не структДанных.ВидСтатистики.Аналитика1.Пустая() Тогда
			УстановитьТип1(структДанных.ВидСтатистики.Аналитика1.ТипАналитикиПолный,структДанных.Аналитика1);	
			структДанных.ЕстьАналитика1 = истина;
		Конецесли;
		
		Если не структДанных.ВидСтатистики.Аналитика2.Пустая() Тогда
			УстановитьТип1(структДанных.ВидСтатистики.Аналитика2.ТипАналитикиПолный,структДанных.Аналитика2);
			структДанных.ЕстьАналитика2 = истина;
		Конецесли;
		
		Если не структДанных.ВидСтатистики.Аналитика3.Пустая() Тогда
			УстановитьТип1(структДанных.ВидСтатистики.Аналитика3.ТипАналитикиПолный,структДанных.Аналитика3);
			структДанных.ЕстьАналитика3 = истина;
		Конецесли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьТип1(ЗначТип, ЗначСтр)	
	ЗначТип1 = ЗначТип;
	ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочник");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документ");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисление");
	ЗначТип1 = СтрЗаменить(ЗначТип1, "ЗадачаСсылка", "Задача");
	
	Если ЗначТип1 = "" Тогда 		
		ЗначСтр = ПредопределенноеЗначение("Справочник.ИА_ЗначениеАналитики.ПустаяСсылка");
	ИначеЕсли ЗначТип1 = "Булево" тогда 
		 ЗначСтр = Ложь;
	ИначеЕсли  ЗначТип1 = "Строка" тогда	
		ЗначСтр = "";
	ИначеЕсли ЗначТип1 = "Число" тогда
		ЗначСтр = 0;
	ИначеЕсли ЗначТип1 = "Дата" тогда
		ЗначСтр = Дата("01010001");
	Иначе
		ЗначСтр = ПредопределенноеЗначение(""+ЗначТип1+".ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитики(номерАналитики, Элемент, тд, СтандартнаяОбработка)
	пт = ПолучитьПолныйТип(тд.ВидСтатистики, номерАналитики);
	Если пт = "СправочникСсылка.ИА_ЗначениеАналитики" или пт = "" Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураОтбора = Новый Структура("Владелец", ПолучитьЗначениеАналитики(тд.ВидСтатистики,номерАналитики));
		ПараметрыВыбора1 = Новый Структура("Отбор", СтруктураОтбора);
		
		зн = Неопределено;

		
		ОткрытьФорму("Справочник.ИА_ЗначениеАналитики.Форма.ФормаВыбораУпр", ПараметрыВыбора1,,,,, Новый ОписаниеОповещения("НачалоВыбораАналитикиЗавершение", ЭтотОбъект, Новый Структура("номерАналитики, тд", номерАналитики, тд)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитикиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	номерАналитики = ДополнительныеПараметры.номерАналитики;
	тд = ДополнительныеПараметры.тд;
	
	
	зн = Результат;
	
	Если ЗначениеЗаполнено(зн) Тогда
		тд["Аналитика"+номерАналитики] = зн;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПолныйТип(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики].ТипАналитикиПолный;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеАналитики(ВидСтатистики, номерАналитики)
	Возврат ВидСтатистики["Аналитика"+номерАналитики];
КонецФункции

&НаКлиенте
Процедура СтатистикиАналитика1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.Статистики.ТекущиеДанные;
	НачалоВыбораАналитики(1, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры


&НаКлиенте
Процедура СтатистикиАналитика2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.Статистики.ТекущиеДанные;
	НачалоВыбораАналитики(2, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры


&НаКлиенте
Процедура СтатистикиАналитика3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.Статистики.ТекущиеДанные;
	НачалоВыбораАналитики(3, Элемент, тд, СтандартнаяОбработка);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура УстановитьПустыеТипы(стр)
	Если (не стр.ВидСтатистики.Аналитика1.Пустая()) и (не ЗначениеЗаполнено(стр.Аналитика1)) Тогда
		УстановитьТип1(стр.ВидСтатистики.Аналитика1.ТипАналитикиПолный,стр.Аналитика1);	
	Конецесли;
	
	Если (не стр.ВидСтатистики.Аналитика2.Пустая()) и (не ЗначениеЗаполнено(стр.Аналитика2)) Тогда
		УстановитьТип1(стр.ВидСтатистики.Аналитика2.ТипАналитикиПолный,стр.Аналитика2);
	Конецесли;
	
	Если (не стр.ВидСтатистики.Аналитика3.Пустая()) и (не ЗначениеЗаполнено(стр.Аналитика3)) Тогда
		УстановитьТип1(стр.ВидСтатистики.Аналитика3.ТипАналитикиПолный,стр.Аналитика3);
	Конецесли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДерево();
		
	Если Объект.Ссылка.Пустая() Тогда
		Объект.РазмерШрифта = 12;
	КонецЕсли;
	
	ВидимостьИДоступностьЭлементов();
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
КонецПроцедуры

//ИА_Арчил Тваладзе 2016.05.19
&НаСервере
Процедура ВидимостьИДоступностьЭлементов()
	
	ИспользоватьРучнойМаштабГрафиков = Константы.ИА_ИспользоватьРучнойМаштабГрафиков.Получить();
	Элементы.СтатистикиГруппаМаштаб.Видимость = ИспользоватьРучнойМаштабГрафиков;
	
КонецПроцедуры
//Конец Арчил Тваладзе

&НаСервереБезКонтекста
Функция ПолучитьАбсолютныйЦвет(ИсходныйЦвет)
    
    Если ИсходныйЦвет.Вид = ВидЦвета.Абсолютный Тогда
        Возврат ИсходныйЦвет;
    КонецЕсли;
	
	путь = ПолучитьИмяВременногоФайла("mxl");
	
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.Область("R1C1").ЦветФона = ИсходныйЦвет;
    ТабДок.Записать(путь, ТипФайлаТабличногоДокумента.MXL7); 
    ТабДок.Прочитать(путь);
    
    АЦвет = ТабДок.Область("R1C1").ЦветФона;
    
    Возврат АЦвет;
    
КонецФункции 

&НаСервере
Процедура ЗаполнитьДерево()
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НомерСтроки,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ПериодДетализации,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЗаголовокДиаграммы,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЦветГрафика,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НаименованиеДляЛегенды,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ПоказыватьВИЦО,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ИА_ПериодКвоты,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ИА_НеОтображатьНаРабочемСтоле,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ИА_ТипКвоты,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЦветГрафикаНарастающейКвоты,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЦветГрафикаХран,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЦветГрафикаНарастающейКвотыХран,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.УзорТочки,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.МаштабМинимум,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.МаштабМаксимум,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.СдвигПериода,
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСдвигаПериода
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.ИА_НастройкиРабочегоСтолаСтатистик.Статистики КАК ИА_НастройкиРабочегоСтолаСтатистикСтатистики
		|ГДЕ
		|	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Иначе
		//при копировании данные берутся из ТЧ		   
		Запрос.Текст = "ВЫБРАТЬ	    
		|	ВремТаблица.НомерСтроки,
		|	ВремТаблица.ВидСтатистики,
		|	ВремТаблица.Аналитика1,
		|	ВремТаблица.Аналитика2,
		|	ВремТаблица.Аналитика3,
		|	ВремТаблица.ПериодДетализации,
		|	ВремТаблица.ЗаголовокДиаграммы,
		|	ВремТаблица.ЦветГрафика,
		|	ВремТаблица.НаименованиеДляЛегенды,
		|	ВремТаблица.ПоказыватьВИЦО,
		|	ВремТаблица.ИА_ПериодКвоты,
		|	ВремТаблица.ИА_НеОтображатьНаРабочемСтоле,
		|	ВремТаблица.ИА_ТипКвоты,
		|	ВремТаблица.ЦветГрафикаНарастающейКвоты,
		|	ВремТаблица.ЦветГрафикаХран,
		|	ВремТаблица.ЦветГрафикаНарастающейКвотыХран,
		|	ВремТаблица.УзорТочки,
		|	ВремТаблица.МаштабМинимум,
		|	ВремТаблица.МаштабМаксимум,
		|	ВремТаблица.СдвигПериода,
		|	ВремТаблица.ВидСдвигаПериода
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВремТаблица КАК ВремТаблица";
		Запрос.УстановитьПараметр("ВремТаблица",Объект.Статистики.Выгрузить());
	КонецЕсли;	   
	Запрос.Выполнить();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ.НомерСтроки,
	               |	ВТ.ВидСтатистики,
	               |	ВТ.Аналитика1,
	               |	ВТ.Аналитика2,
	               |	ВТ.Аналитика3,
	               |	ВТ.ПериодДетализации,
	               |	ВТ.ЗаголовокДиаграммы КАК ЗаголовокДиаграммы,
	               |	ВТ.ЦветГрафикаХран,
	               |	ВТ.НаименованиеДляЛегенды,
	               |	ВТ.ПоказыватьВИЦО,
	               |	ВТ.ИА_ПериодКвоты,
	               |	ВТ.ИА_НеОтображатьНаРабочемСтоле,
	               |	ВТ.ИА_ТипКвоты,
	               |	ВТ.ЦветГрафикаНарастающейКвотыХран,
	               |	ИСТИНА КАК ЭтоПодчиненная,
	               |	ВЫБОР
	               |		КОГДА ВТ.ВидСтатистики.Аналитика1 = ЗНАЧЕНИЕ(Справочник.ИА_ВидыАналитикиСтатистики.ПустаяСсылка)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьАналитика1,
	               |	ВЫБОР
	               |		КОГДА ВТ.ВидСтатистики.Аналитика2 = ЗНАЧЕНИЕ(Справочник.ИА_ВидыАналитикиСтатистики.ПустаяСсылка)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьАналитика2,
	               |	ВЫБОР
	               |		КОГДА ВТ.ВидСтатистики.Аналитика3 = ЗНАЧЕНИЕ(Справочник.ИА_ВидыАналитикиСтатистики.ПустаяСсылка)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьАналитика3,
	               |	ВТ.УзорТочки,
	               |	ВЫБОР
	               |		КОГДА ВТ.ЦветГрафикаХран = """"
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЦветОчищен,
	               |	ВЫБОР
	               |		КОГДА ВТ.ЦветГрафикаНарастающейКвотыХран = """"
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЦветНКОчищен,
	               |	ВТ.МаштабМинимум,
	               |	ВТ.МаштабМаксимум,
	               |	ВТ.СдвигПериода,
	               |	ВТ.ВидСдвигаПериода
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ.НомерСтроки
	               |ИТОГИ ПО
	               |	ЗаголовокДиаграммы
	               |АВТОУПОРЯДОЧИВАНИЕ";
				    
	Дер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Дер.Колонки.Добавить("ЦветГрафика", Новый ОписаниеТипов("Цвет"));
	Дер.Колонки.Добавить("ЦветГрафикаНарастающейКвоты", Новый ОписаниеТипов("Цвет"));
	
	Для каждого стр из Дер.Строки Цикл
		ЗаполнитьЗначенияСвойств(стр, стр.Строки[0]);
		ЗаполнитьЦвета(стр);
		Если стр.Строки.Количество() = 1 Тогда
			стр.Строки.Очистить();
		ИначеЕсли стр.Строки.Количество() >= 2 Тогда
			стр.Строки.Удалить(стр.Строки[0]);
		КонецЕсли;
		
		стр.ЭтоПодчиненная = ложь;
		
		УстановитьПустыеТипы(стр);		
		Для каждого стр1 из стр.Строки Цикл
			ЗаполнитьЦвета(стр1);
			УстановитьПустыеТипы(стр1);		
		КонецЦикла;
	КонецЦикла;
	
	Дер.Колонки.Удалить("ЦветГрафикаХран");
	Дер.Колонки.Удалить("ЦветГрафикаНарастающейКвотыХран");

	ЗначениеВРеквизитФормы(дер, "Дерево");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЦвета(Стр)
	Если стр.ЦветГрафикаХран<>"" Тогда
		стр.ЦветГрафика = Вычислить("Новый Цвет("+стр.ЦветГрафикаХран+")");
	КонецЕсли;
	Если стр.ЦветГрафикаНарастающейКвотыХран<>"" Тогда
		стр.ЦветГрафикаНарастающейКвоты = Вычислить("Новый Цвет("+стр.ЦветГрафикаНарастающейКвотыХран+")");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если не ИА_Защита_Общий.ЛицензияДоступна("Статистика") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Попытка
			объект.СлужебнаяНастройка = этаформа.ВладелецФормы.Родитель.Служебные;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТипКвотыПриИзменении(Элемент)
	
	Если Элементы.Статистики.ТекущиеДанные.ИА_ТипКвоты = ПредопределенноеЗначение("Перечисление.ИА_ТипыКвот.Нарастающая") Тогда
		Если не ЗначениеЗаполнено(Элементы.Статистики.ТекущиеДанные.ПериодДетализации) Тогда
			возврат;
		КонецЕсли;
		
		Структура = ПолучитьСтруктуруПериодов();
		Зн = Структура.Получить(Элементы.Статистики.ТекущиеДанные.ПериодДетализации);
		Для каждого элем из Структура Цикл
			Если Элем.Значение = Зн + 1 Тогда
				Элементы.Статистики.ТекущиеДанные.ИА_ПериодКвоты = Элем.Ключ;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	ИначеЕсли Элементы.Статистики.ТекущиеДанные.ИА_ТипКвоты = ПредопределенноеЗначение("Перечисление.ИА_ТипыКвот.Обычная") Тогда
		Элементы.Статистики.ТекущиеДанные.ИА_ПериодКвоты = Элементы.Статистики.ТекущиеДанные.ПериодДетализации;
	Иначе
		Элементы.Статистики.ТекущиеДанные.ИА_ПериодКвоты = Неопределено; 		
	КонецЕсли;	
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодКвотыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.Статистики.ТекущиеДанные.ИА_ПериодКвоты) Тогда
		Структура = ПолучитьСтруктуруПериодов();
		ПериодКвоты = Элементы.Статистики.ТекущиеДанные.ИА_ПериодКвоты;
		ПериодДетализации = Элементы.Статистики.ТекущиеДанные.ПериодДетализации;
		
		Если Структура.Получить(ПериодДетализации) - Структура.Получить(ПериодКвоты) > 0 Тогда
			Сообщить("Период квоты не может быть меньше периода детализации", СтатусСообщения.Информация); 
			Элементы.Статистики.ТекущиеДанные.ИА_ПериодКвоты = Неопределено;
			Возврат;
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПериодов()  
	
	Структура = Новый Соответствие;
	Структура.Вставить(ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День"), 1);
	Структура.Вставить(ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя"), 2);
	Структура.Вставить(ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц"), 3);
	Структура.Вставить(ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал"), 4);
	Структура.Вставить(ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год"), 5);
	
	Возврат Структура;
	
КонецФункции // ПолучитьСтруктуруПериодов()

&НаКлиенте
Функция УстановитьВидимостьДоступность()

	ТекДанные = Элементы.Статистики.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.ИА_ТипКвоты = ПредопределенноеЗначение("Перечисление.ИА_ТипыКвот.Нарастающая") Тогда
			Элементы.СтатистикиИА_ПериодКвоты.Доступность = Истина;
			Элементы.СтатистикиИА_ЦветГрафикаНарастающейКвоты.Доступность = Истина;
		ИначеЕсли ТекДанные.ИА_ТипКвоты = ПредопределенноеЗначение("Перечисление.ИА_ТипыКвот.Обычная") Тогда
			Элементы.СтатистикиИА_ПериодКвоты.Доступность = Ложь; 
			Элементы.СтатистикиИА_ЦветГрафикаНарастающейКвоты.Доступность = Ложь;
		Иначе
			Элементы.СтатистикиИА_ПериодКвоты.Доступность = Ложь; 		
			Элементы.СтатистикиИА_ЦветГрафикаНарастающейКвоты.Доступность = Ложь;
		КонецЕсли;	
		
		Элементы.СтатистикиДобавитьВторуюСтатистику.Доступность = ТекДанные.ПолучитьРодителя() = Неопределено; 
	КонецЕсли;

КонецФункции // УстановитьВидимостьДоступность()

&НаКлиенте
Процедура СтатистикиПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиПериодДетализацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Статистики.ТекущиеДанные;
	
	Если ТекущиеДанные.ИА_ТипКвоты = ПредопределенноеЗначение("Перечисление.ИА_ТипыКвот.Обычная") Тогда
		ТекущиеДанные.ИА_ПериодКвоты = ТекущиеДанные.ПериодДетализации;
	Иначе
		ТекущиеДанные.ИА_ПериодКвоты = Неопределено;
	КонецЕсли;
	
	Для каждого ПодСтрокаТекущиеДанные из ТекущиеДанные.ПолучитьЭлементы() Цикл
		
		ПодСтрокаТекущиеДанные.ПериодДетализации = ТекущиеДанные.ПериодДетализации;
		Если Не ПроверитьСовместимостьПериодов(ПодСтрокаТекущиеДанные) Тогда
			ПодСтрокаТекущиеДанные.ВидСдвигаПериода = ТекущиеДанные.ПериодДетализации;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПеревернутыеСтатистики(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого СтрокаДерева из Дерево.ПолучитьЭлементы() Цикл
		
		СтрокиГрафика = СтрокаДерева.ПолучитьЭлементы();
		КоличествоГрафиков = СтрокиГрафика.Количество()+ 1;
		КоличествоПеревернутыхГрафиков = 0;
		
		ПеревернутаяСтатистика = СтрокаДерева.ВидСтатистики.ПеревернутаяСтатистика;
		Если ПеревернутаяСтатистика Тогда
			КоличествоПеревернутыхГрафиков = КоличествоПеревернутыхГрафиков + 1;
			ПеревернутыйГрафик = СтрокаДерева;
		КонецЕсли;
		
		Для каждого СтрокаГрафика из СтрокиГрафика Цикл
			ПеревернутаяСтатистика = СтрокаГрафика.ВидСтатистики.ПеревернутаяСтатистика;
			Если ПеревернутаяСтатистика Тогда
				КоличествоПеревернутыхГрафиков = КоличествоПеревернутыхГрафиков + 1;
				ПеревернутыйГрафик = СтрокаГрафика;
			КонецЕсли;
		КонецЦикла;
		
		Если (КоличествоПеревернутыхГрафиков <> 0) и (КоличествоПеревернутыхГрафиков <> КоличествоГрафиков) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Перевернутая статистика: "+ ПеревернутыйГрафик.ВидСтатистики + "! На одном поле, должны быть либо все прямые, либо все перевернутые.";
			Сообщение.Сообщить(); 
			
			Отказ = Истина;
			
			Возврат;

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюСервер(Отказ, ПараметрыЗаписи)
	
	ПроверитьПеревернутыеСтатистики(Отказ, Объект, ПараметрыЗаписи);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Объект.Статистики.Очистить();
	
	Для каждого стр из Дерево.ПолучитьЭлементы() Цикл
		Если стр.ПериодДетализации.Пустая() Тогда
			Сообщить("Заполните периодичность графика!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Новстр = Объект.Статистики.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		//
		Новстр.ЦветГрафикаХран = ?(стр.ЦветОчищен,"",ИА_Статистики.ПолучитьПредставлениеЦвета(стр.ЦветГрафика));
		Новстр.ЦветГрафикаНарастающейКвотыХран = ?(стр.ЦветНКОчищен,"",ИА_Статистики.ПолучитьПредставлениеЦвета(стр.ЦветГрафикаНарастающейКвоты));
		//
		Заголовок = стр.НаименованиеДляЛегенды;
		Если стр.ПолучитьЭлементы().Количество()>0 Тогда
			Для каждого стр1 из стр.ПолучитьЭлементы() Цикл
				Заголовок = Заголовок + " / " + стр1.НаименованиеДляЛегенды;
			КонецЦикла;
		КонецЕсли;
		Новстр.ЗаголовокДиаграммы = Заголовок;
		
		Для каждого стр1 из стр.ПолучитьЭлементы() Цикл
			Новстр = Объект.Статистики.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стр1);
			Новстр.ЗаголовокДиаграммы = Заголовок;
			Новстр.ПериодДетализации = стр.ПериодДетализации;
			//
			Новстр.ЦветГрафикаХран = ?(стр1.ЦветОчищен,"",ИА_Статистики.ПолучитьПредставлениеЦвета(стр1.ЦветГрафика));
			Новстр.ЦветГрафикаНарастающейКвотыХран = ?(стр1.ЦветНКОчищен,"",ИА_Статистики.ПолучитьПредставлениеЦвета(стр1.ЦветГрафикаНарастающейКвоты));
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатистику(Команда)
	Новстр = Дерево.ПолучитьЭлементы().Добавить();
	Новстр.ПериодДетализации = Объект.ОсновнойПериодДетализации;
	Новстр.ЦветОчищен = истина;
	Новстр.ЦветНКОчищен = истина;
	
	ОткрытьФорму("Справочник.ИА_ВидыСтатистик.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ДобавитьСтатистикуЗавершение", ЭтотОбъект, Новый Структура("Новстр", Новстр)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатистикуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Новстр = ДополнительныеПараметры.Новстр;	
	Новстр.ВидСтатистики = Результат;
	
	Элементы.Статистики.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
	СтатистикиВидСтатистикиПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВторуюСтатистику(Команда)
	тс = Элементы.Статистики.ТекущаяСтрока;
	Новстр = Дерево.НайтиПоИдентификатору(тс).ПолучитьЭлементы().Добавить();
	Новстр.ПериодДетализации = Элементы.Статистики.ТекущиеДанные.ПериодДетализации;
	Новстр.ЭтоПодчиненная = истина;
	Новстр.ЦветОчищен = истина;
	Новстр.ЦветНКОчищен = истина;
	
	ОткрытьФорму("Справочник.ИА_ВидыСтатистик.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ДобавитьВторуюСтатистикуЗавершение", ЭтотОбъект, Новый Структура("Новстр", Новстр)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВторуюСтатистикуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Новстр = ДополнительныеПараметры.Новстр;
	
	
	Новстр.ВидСтатистики = Результат;
	
	Элементы.Статистики.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
	СтатистикиВидСтатистикиПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СтатистикиПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ДопПараметрыГрафика(Команда)
	Элементы.СтатистикиДопПараметрыГрафика.Пометка = не Элементы.СтатистикиДопПараметрыГрафика.Пометка;
	Элементы.СтатистикиГруппаДоп.Видимость = Элементы.СтатистикиДопПараметрыГрафика.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиЦветГрафикаПриИзменении(Элемент)
	тд = Элементы.Статистики.ТекущиеДанные;
	Если тд.ЦветОчищен Тогда
		возврат;
	КонецЕсли;
	
	тд.ЦветГрафика = ПолучитьАбсолютныйЦвет(тд.ЦветГрафика);
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиИА_ЦветГрафикаНарастающейКвотыПриИзменении(Элемент)
	тд = Элементы.Статистики.ТекущиеДанные;
	Если тд.ЦветНКОчищен Тогда
		возврат;
	КонецЕсли;

	тд.ЦветГрафикаНарастающейКвоты = ПолучитьАбсолютныйЦвет(тд.ЦветГрафикаНарастающейКвоты);
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиЦветГрафикаОчистка(Элемент, СтандартнаяОбработка)
	тд = Элементы.Статистики.ТекущиеДанные;
	тд.ЦветОчищен = истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиИА_ЦветГрафикаНарастающейКвотыОчистка(Элемент, СтандартнаяОбработка)
	тд = Элементы.Статистики.ТекущиеДанные;
	тд.ЦветНКОчищен = истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиЦветГрафикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.Статистики.ТекущиеДанные;
	тд.ЦветОчищен = ложь;
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиИА_ЦветГрафикаНарастающейКвотыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.Статистики.ТекущиеДанные;
	тд.ЦветНКОчищен = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюКлиент(Отказ, ПараметрыЗаписи);
	
	Если не Отказ Тогда
		ПередЗаписьюСервер(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюКлиент(Отказ, ПараметрыЗаписи)
	
	Для каждого стрСтатистики Из Объект.Статистики Цикл
		Если стрСтатистики.СдвигПериода <> 0 и Не ЗначениеЗаполнено(стрСтатистики.ВидСдвигаПериода) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В статистике "+ стрСтатистики.НаименованиеДляЛегенды +" указан сдвиг, но не заполнен вид сдвига!";
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
		Если НЕ ПроверитьСовместимостьПериодов(стрСтатистики) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = """Вид сдвига периода"" не может быть меньше ""Периода детализации""!";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиСдвигПериодаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Статистики.ТекущиеДанные;
	ЗаполнитьНаименованиеДляЛегенды(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиВидСдвигаПериодаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Статистики.ТекущиеДанные;
	
	Если НЕ ПроверитьСовместимостьПериодов(ДанныеСтроки) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = """Вид сдвига периода"" не может быть меньше ""Периода детализации""!";
		Сообщение.Сообщить();
		
		ДанныеСтроки.ВидСдвигаПериода = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.ПустаяСсылка");
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьНаименованиеДляЛегенды(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьСовместимостьПериодов(ДанныеСтроки)
	
	Если ИА_Статистики.ТиповыеПериоды_БольшеИлиРавно(ДанныеСтроки.ВидСдвигаПериода, ДанныеСтроки.ПериодДетализации) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьНаименованиеДляЛегенды(ДанныеСтроки)
	
	НаименованиеДляЛегенды = Строка(ДанныеСтроки.ВидСтатистики);
	
	Если ЗначениеЗаполнено(ДанныеСтроки.СдвигПериода) Тогда
		НаименованиеДляЛегенды =  НаименованиеДляЛегенды + " (сдвиг "+ ДанныеСтроки.СдвигПериода + " "+ ИА_Статистики.ПолучитьПредставениеПериодаДетализации(ДанныеСтроки.СдвигПериода, ДанныеСтроки.ВидСдвигаПериода)+")";  
	КонецЕсли;
	
	ДанныеСтроки.НаименованиеДляЛегенды = НаименованиеДляЛегенды;

КонецПроцедуры

&НаКлиенте
Процедура СтатистикиВидСдвигаПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.Статистики.ТекущиеДанные;

	ДанныеВыбора = Новый СписокЗначений;

	СтатистикиВидСдвигаПериодаНачалоВыбораНаКлиенте(ДанныеВыбора, ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикиВидСдвигаПериодаНачалоВыбораНаКлиенте(ДанныеВыбора, ДанныеСтроки)
	
	СтруктураВыбора = СтатистикиВидСдвигаПериодаПолучитьСтруктуруВыбораНаСервере();
	
	ПериодДетализации = ДанныеСтроки.ПериодДетализации;
	Для каждого СтрокаПериодов Из СтруктураВыбора Цикл
		Если Не ЗначениеЗаполнено(ПериодДетализации) ИЛИ ТиповыеПериоды_БольшеИлиРавно(СтрокаПериодов.Значение, ДанныеСтроки.ПериодДетализации) Тогда
			ДанныеВыбора.Добавить(СтрокаПериодов.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТиповыеПериоды_БольшеИлиРавно(ТиповойПериод1, ТиповойПериод2)
	Возврат ИА_Статистики.ТиповыеПериоды_БольшеИлиРавно(ТиповойПериод1, ТиповойПериод2);
КонецФункции

&НаСервереБезКонтекста
Функция СтатистикиВидСдвигаПериодаПолучитьСтруктуруВыбораНаСервере()
	
	СтруктураВыбора = Новый Структура;
	
	Для каждого СтрокаПериодов Из Перечисления.ИА_ПериодыДетализации Цикл
		СтруктураВыбора.Вставить(СтрокаПериодов, СтрокаПериодов);
	КонецЦикла;
	
	Возврат СтруктураВыбора; 
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры
